{
    "header": {
        "welcome": "Hello World!",
        "presentation": "It's me",
        "description": "Automation",
        "name": "Jesus Sirit",
        "role": "Specialist"
    },
    "nav": {
        "home": "Home",
        "about": "About",
        "projects": "Projects",
        "skills": "Skills",
        "contact": "Contact"
    },
    "navCard": {
        "name": "Jesus Sirit",
        "role": "Automation Specialist"
    },
    "about": {
        "title": "About me",
        "first-text": "I'm an Automation Specialist focused on optimizing processes, integrating systems, and improving operational efficiency through automation. I build end-to-end automated workflows using Make, Zapier, and n8n, supported by a solid background in web and backend development with JavaScript/TypeScript, Python, Java and Spring Boot.",
        "second-text": "I combine precise analysis, structured thinking, and agile execution to design effective solutions."
    },
    "projectPage": {
        "subtitle": "Portfolio",
        "prepo": "My",
        "title": "Creative Works",
        "code": "Code"
    },
    "projects": {
        "product_api": {
          "title": "Product Management - API Rest",
          "description": "This project is a RESTful API built with Spring Boot, designed for managing products, categories, users, and orders."
        },
        "medical_app": {
          "title": "Medical Appointments Manager",
          "description": "This is a web application developed using Spring Boot that allows patients to register, view available doctors, and schedule or cancel medical appointments."
        },
        "chat_app": {
          "title": "Real-Time Chat Application",
          "description": "Real-time messaging app for public rooms and private chats. Built the backend with Node.js + TypeScript, Express, Socket.IO and the frontend with React + TailwindCSS"
        },
        "attendance_api": {
          "title": "Employee Attendance System - API Rest",
          "description": "This is a RESTful API built with Spring Boot for managing employee attendance within a company."
        },
        "event_driven_webhook": {
          "title": "Event-Driven Webhook Processing & Action Orchestration",
          "description": "Centralized webhook processor that normalizes incoming events and triggers actions across Google Sheets, Todoist, and HubSpot with Slack notifications."
        }
      },
      "skills": {
        "title": "Skills"
    },
    "contact": {
        "title": "Let's Connect",
        "labelName": "Name",
        "placeholderName": "Your name",
        "labelEmail": "Email",
        "placeholderEmail": "your.email@example.com",
        "labelMessage": "Message",
        "placeholderMessage": "Your message here...",
        "sendMessageBtn": "Send message",
        "sendingMessageBtn": "Sending...",
        "msgError": "Failed to send message. Please try again.",
        "msgSuccess:": "Message sent successfully!"
    },
    "workflows_texts": {
      "context": "Problem context",
      "objetive": "Workflow objective",
      "flow": "Automation flow",
      "stack": "Technologies used",
      "result": "Result and value generated"
    },

    "workflows": {
      "event_driven_webhook": {
        "title": "Event-Driven Webhook Processing & Action Orchestration",
        "category": "Automation",
        "shortDescription": "Centralized webhook processor that normalizes incoming events and triggers actions across Google Sheets, Todoist, and HubSpot with Slack notifications.",
        "longDescription": "This workflow, built entirely in n8n, processes incoming contact events from multiple sources (forms, applications, platforms), normalizes the data, dynamically routes events to the appropriate system, and sends contextual notifications to Slack for full operational visibility.",

        "context": "Previously, incoming contact information from various sources had to be manually processed, leading to delays, inconsistent formatting, and a lack of visibility into where data was stored or actions taken. This workflow centralizes the process and automates it end-to-end.",

        "objective": "Automate the ingestion, normalization, routing, and notification of contact events to improve accuracy, efficiency, and operational visibility, reducing manual intervention.",

        "flow": [
          "Webhook receives incoming contact information (name, email, company, employee size) and source (FORM, APP, PLATFORM).",
          "Edit Fields node normalizes data: emails to lowercase, names capitalized, company and source in uppercase.",
          "Switch node routes events based on source:",
          "→ FORM: Save contact information to Google Sheets.",
          "→ APP: Create a task in Todoist. Priority is high if company has more than 1000 employees, medium otherwise.",
          "→ PLATFORM: Create a new contact in HubSpot.",
          "Slack node sends a notification with details about the new submission and its storage destination."
        ],

        "stack": [
          "n8n",
          "Google Sheets API",
          "Todoist API",
          "HubSpot API",
          "Slack API",
          "JavaScript"
        ],

        "result": "Reduced manual data processing time, ensured consistent and normalized contact information, improved operational visibility with Slack notifications, and dynamically prioritized tasks in Todoist based on company size.",

        "repo": "https://github.com/your-user/event-driven-webhook",
        "image": "/img/workflows/event_driven_webhook.png",
        "imageAlt": "Diagram showing the Event-Driven Webhook workflow in n8n with routing and Slack notifications"
      }

  }
}