{
    "header": {
        "welcome": "Hola mundo!",
        "presentation": "Soy",
        "description": "Especialista en",
        "name": "Jesús Sirit",
        "role": "Automatización"
    },

    "nav": {
        "home": "Inicio",
        "about": "Sobre mí",
        "projects": "Proyectos",
        "skills": "Habilidades",
        "contact": "Contacto"
      },
      "navCard": {
          "name": "Jesús Sirit",
          "role": "Especialista en Automatización"
      },
      "about": {
        "title": "Sobre mí",
        "first-text": "Especialista en Automatización enfocado en optimizar procesos, integrar sistemas y mejorar la eficiencia operativa a través de la automatización. Construyo flujos de trabajo automatizados de extremo a extremo utilizando Make, Zapier y n8n, respaldado por una sólida experiencia en desarrollo web y backend con JavaScript/TypeScript, Python, Java y Spring Boot.",
        "second-text": "Combino el análisis preciso, el pensamiento estructurado y la ejecución ágil para diseñar soluciones efectivas"
    },
    "projectPage": {
        "subtitle": "Portafolio",
        "prepo": "Mis",
        "title": "Proyectos",
        "code": "Código"
    },
    "projects": {
        "product_api": {
          "title": "Gestión de Productos - API Rest",
          "description": "Este proyecto es una API RESTful construida con Spring Boot para gestionar productos, categorías, usuarios y pedidos."
        },
        "medical_app": {
          "title": "Gestor de Citas Médicas",
          "description": "Aplicación web desarrollada con Spring Boot que permite a los pacientes registrarse, ver doctores disponibles y agendar o cancelar citas médicas."
        },
        "chat_app": {
          "title": "Aplicación de Chat en Tiempo Real",
          "description": "App de mensajería en tiempo real para salas públicas y chats privados. Backend con Node.js + TypeScript, Express, Socket.IO y frontend con React + TailwindCSS."
        },
        "attendance_api": {
          "title": "Sistema de Asistencia de Empleados - API Rest",
          "description": "API RESTful construida con Spring Boot para gestionar la asistencia de empleados dentro de una empresa"
        },
        "event_driven_webhook": {
          "title": "Procesamiento de Webhooks Basado en Eventos y Orquestación de Acciones",
          "description": "Procesador centralizado de webhooks que normaliza eventos entrantes y ejecuta acciones en Google Sheets, Todoist y HubSpot con notificaciones en Slack."
        },
          "lead_intake_scoring_orchestration": {
            "title": "Ingesta de Leads, Validación y Orquestación Inteligente",
            "description": "Workflow de procesamiento de leads de extremo a extremo que valida, normaliza, puntúa y enruta información usando HubSpot, Google Sheets, Gmail y Slack."
        }        
      },
    "skills": {
        "title": "Habilidades"
    },
    "contact": {
        "title": "Contáctame",
        "labelName": "Nombre",
        "placeholderName": "Su nombre",
        "labelEmail": "Correo electrónico",
        "placeholderEmail": "tucorreo@ejemplo.com",
        "labelMessage": "Mensaje",
        "placeholderMessage": "Su mensaje aquí...",
        "sendMessageBtn": "Enviar mensaje",
        "sendingMessageBtn": "Enviando...",
        "msgError": "Error al enviar el correo. Inténtalo de nuevo",
        "msgSuccess:": "!Mensaje enviado exitosamente!"
    },
    "workflows_texts": {
      "context": "Contexto del problema",
      "objective": "Objetivo del workflow",
      "flow": "Flujo de automatización",
      "stack": "Tecnologías utilizadas",
      "result": "Resultado y valor generado"
    },
    "workflows": [
      {
        "id": "event_driven_webhook",
        "title": "Procesamiento de Webhooks Basado en Eventos y Orquestación de Acciones",
        "category": "Automatización",
        "shortDescription": "Procesador centralizado de webhooks que normaliza eventos entrantes y ejecuta acciones en Google Sheets, Todoist y HubSpot con notificaciones en Slack.",
        "longDescription": "Este workflow, construido completamente en n8n, procesa eventos de contacto entrantes desde múltiples fuentes (formularios, aplicaciones, plataformas), normaliza los datos, dirige dinámicamente los eventos al sistema correspondiente y envía notificaciones contextuales en Slack para visibilidad operacional completa.",
        "context": "Antes, la información de contacto entrante desde diversas fuentes se procesaba manualmente, lo que generaba demoras, inconsistencias en el formato y falta de visibilidad sobre dónde se almacenaban los datos o qué acciones se ejecutaban. Este workflow centraliza y automatiza todo el proceso de manera integral.",
        "objective": "Automatizar la ingestión, normalización, direccionamiento y notificación de eventos de contacto para mejorar la precisión, eficiencia y visibilidad operacional, reduciendo la intervención manual.",
        "flow": [
          "El webhook recibe la información de contacto entrante (nombre, email, empresa, tamaño por empleados) y su fuente (FORM, APP, PLATFORM).",
          "Nodo Edit Fields normaliza los datos: emails en minúsculas, nombres capitalizados, empresa y fuente en mayúsculas.",
          "Nodo Switch direcciona los eventos según la fuente:",
          "→ FORM: Guardar la información de contacto en Google Sheets.",
          "→ APP: Crear una tarea en Todoist. Prioridad alta si la empresa tiene más de 1000 empleados, media en caso contrario.",
          "→ PLATFORM: Crear un nuevo contacto en HubSpot.",
          "Nodo Slack envía una notificación con detalles de la nueva solicitud y dónde se almacenaron los datos."
        ],
        "stack": [
          "n8n",
          "Google Sheets API",
          "Todoist API",
          "HubSpot API",
          "Slack API",
          "JavaScript"
        ],
        "result": "Redujo el tiempo de procesamiento manual, aseguró información de contacto consistente y normalizada, mejoró la visibilidad operacional con notificaciones en Slack y priorizó dinámicamente las tareas en Todoist según el tamaño de la empresa.",
        "repo": "https://github.com/your-user/event-driven-webhook",
        "image": "/img/workflows/event_driven_webhook.png",
        "imageAlt": "Diagrama que muestra el workflow de Webhook basado en eventos en n8n con rutas y notificaciones en Slack"
      },
      {
      "id": "lead_intake_scoring_orchestration",
      "title": "Ingesta de Leads, Validación y Orquestación Inteligente",
      "category": "automation",
      "shortDescription": "Workflow de procesamiento de leads de extremo a extremo que valida, normaliza, puntúa y enruta información usando HubSpot, Google Sheets, Gmail y Slack.",
      "longDescription": "Este workflow, construido con n8n, automatiza todo el ciclo de vida de los leads entrantes. Valida y normaliza los datos, detecta duplicados, calcula el lead scoring y enruta dinámicamente cada lead según reglas de negocio, garantizando eficiencia, calidad de datos y visibilidad operativa.",

      "context": "Los leads provenientes de distintas fuentes se procesaban manualmente, lo que generaba datos inconsistentes, registros duplicados, respuestas tardías y poca visibilidad para el equipo comercial. El manejo de errores era limitado, dificultando el monitoreo y la depuración.",

      "objective": "Automatizar la ingesta, validación, normalización, scoring y enrutamiento de leads, incorporando manejo de errores confiable, registro de eventos y notificaciones en tiempo real para mejorar la eficiencia comercial y la calidad de los datos.",

      "flow": [
        "Un webhook recibe los datos del lead desde fuentes externas.",
        "Un nodo de Código valida los campos obligatorios y formatos; si hay errores, se responde inmediatamente.",
        "Los datos se normalizan: emails en minúsculas, códigos de país en mayúsculas y nombres en formato título.",
        "Un nodo de Google Sheets verifica si el email ya existe para evitar duplicados.",
        "Si se detecta un duplicado, el workflow registra el evento y retorna una respuesta de error.",
        "Un nodo de Código calcula el lead scoring según reglas de negocio predefinidas.",
        "Un nodo Switch enruta el lead según su puntuación:",
        "Leads Cold (score < 40): se envía un correo de confirmación por Gmail.",
        "Leads Warm (score 41–80): se crea un contacto en HubSpot.",
        "Leads Hot (score > 80): se crea un contacto en HubSpot y se genera un ticket automáticamente.",
        "El lead se guarda en Google Sheets junto con su tipo y timestamp.",
        "Se envía una respuesta exitosa por el webhook y una notificación a Slack.",
        "Los errores no controlados son capturados por un Error Trigger y registrados en Google Sheets con detalles de la ejecución."
      ],

      "stack": [
        "n8n",
        "JavaScript",
        "Google Sheets API",
        "HubSpot API",
        "Gmail API",
        "Slack API"
      ],

      "result": "El workflow reduce el manejo manual de leads, garantiza datos consistentes y validados, evita duplicados, mejora los tiempos de respuesta para leads de alto valor y proporciona visibilidad completa mediante logs estructurados y notificaciones en Slack.",

      "repo": "https://github.com/your-user/lead-intake-scoring-orchestration",
      "image": "/img/workflows/lead_intake_scoring_orchestration.png",
      "imageAlt": "Diagrama del workflow de ingesta y scoring de leads en n8n con validación, enrutamiento e integraciones"
    }
    ]
}

